# ðŸ§¼ Data Preprocessing Example

This notebook shows how to use the data loader and preprocessing functions.

In [9]:
import sys, pathlib
sys.path.insert(0, str(pathlib.Path("/Users/jeffreychapple/Repositories/my_data_science_project/notebooks/preprocessing_example.ipynb").resolve().parents[1]))  # add project root


from src.data_loader import load_data
from src.preprocessing import clean_data

In [10]:
# Load raw data
df = load_data('people.csv')
df.head()

Loaded 5 records from /Users/jeffreychapple/Repositories/my_data_science_project/data/raw/people.csv

   id     name  age  income city
0   1    Alice   25   50000   NY
1   2      Bob   30   60000   LA
2   3  Charlie   35   70000   NY
3   4    David   40   80000   SF
4   5      Eve   22   45000   LA

In [11]:
# Clean data
df_clean = clean_data(df)
df_clean.head()

,id,age,income,name_Bob,name_Charlie,name_David,name_Eve,city_NY,city_SF
0,1,25,50000,False,False,False,False,True,False
1,2,30,60000,True,False,False,False,False,False
2,3,35,70000,False,True,False,False,True,False
3,4,40,80000,False,False,True,False,False,True
4,5,22,45000,False,False,False,True,False,False

In [13]:
# Save processed data
df_clean.to_csv('/Users/jeffreychapple/Repositories/my_data_science_project/data/processed/people_clean.csv', index=False)